app/controllers/users_controller.rb

UPDATE `users` SET `users`.`first_name` = 'SS', `users`.`last_name` = 'SS', `users`.`email` = 'normaluser3@gmail.com', `users`.`updated_at` = '2022-05-30 15:47:54.388420' WHERE `users`.`id` = 3
---
  def update
    unless current_user.is_admin
      redirect_to root_path
    end

    respond_to do |format|
      if @user.update(user_params)

DELETE FROM `users` WHERE `users`.`id` = 1
---
  def destroy
    unless current_user.is_admin
      redirect_to root_path
    end

    @user.destroy